Tekla.Structures.Model.LoadArea.AreaLoadFormEnum
The area load form.

Tekla.Structures.Model.LoadArea.AreaLoadFormEnum.LOAD_FORM_AREA_PARALLELOGRAM
The area load form is a parallelogram.

Tekla.Structures.Model.LoadArea.AreaLoadFormEnum.LOAD_FORM_AREA_TRIANGLE
The area load form is a triangle.